cases/Tan/constant/momentumTransport.nitrogen
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport.nitrogen;
}

simulationType  laminar;
