cases/Tan/constant/momentumTransport.water
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport.water;
}

simulationType  laminar;
