cases/Tan/0.org/U.nitrogen
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.nitrogen;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.nitrogen;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
}
