cases/Tan/0.org/U.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.water;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.water;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
}
