cases/Tan/0.org/T.nitrogen
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.nitrogen;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.nitrogen;
        inletValue      $internalField;
        value           $internalField;
    }
    walls
    {
        type            zeroGradient;
    }
}
