cases/Tan/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;

    div(phi,alpha.nitrogen)         Gauss vanLeer;
    div(phi,alpha.water)            Gauss vanLeer;

    "div\(phir,alpha.*\)"           Gauss vanLeer;

    div(phi,Nf)                     Gauss vanLeer;
    div(phi,Nc)                     Gauss vanLeer;

    div(alphaPhi.nitrogen,lambda.nitrogen)
                                    Gauss vanLeer;
    div(alphaPhi.nitrogen,kappa.nitrogen)
                                    Gauss vanLeer;

    "div\(alphaRhoPhi.*,(k|epsilon|omega).*\)"
                                    Gauss upwind;

    "div\(alphaRhoPhi.*,\(p\|thermo:rho.*\)\)"
                                    Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"      Gauss limitedLinearV 1;
    "div\(phi.*,U.*\)"              Gauss limitedLinearV 1;

    "div\(alphaRhoPhi.*,(h|e).*\)"  Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,K.*\)"      Gauss limitedLinear 1;
    "div\(alphaPhi.*,p\)"           Gauss limitedLinear 1;

    "div\(\(\(\(alpha.*\*thermo:rho.*\)*nuEff.*\)\*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

wallDist
{
    method          meshWave;
}
